03_CellGrowthSolver/testCase/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-8;

boundaryField
{
    Behaelter
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    DO
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    PH
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    PNR
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    PT100
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    Ruehrer
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    Ruehrer1
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    PNR1 
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    Top
    {
        type            symmetry;
    }
}


// ************************************************************************* //
