03_CellGrowthSolver/testCase/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1e-4;

boundaryField
{

    wall1 
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    bottom
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    
    stirrerholder    
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    stirrer
    {
        type            omegaWallFunction;
        value           $internalField;
    }


    top
    {
        type		symmetry;
    }

}


// ************************************************************************* //
