03_CellGrowthSolver/testCase/constant/initialCellProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

CellDensity 			0.5;  		// g per L
MueMax 				0.0011805556; 	// per s -->  1.02 per hour 
Substrate 			5; 		// g per L
Ks                              0.001;           // g per L 
Yxs	                        0.98;           // g per g          

// ************************************************************************* //
