03_CellGrowthSolver/testCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

// X Y Z Werte für Block jeweils Eckposition
vertices 
(
    ( -0.05 -0.05 -0.02)
    (  0.05 -0.05 -0.02)
    (  0.05  0.05 -0.02)
    ( -0.05  0.05 -0.02)
    ( -0.05 -0.05  0.15)
    (  0.05 -0.05  0.15)
    (  0.05  0.05  0.15)
    ( -0.05  0.05  0.15)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 57) simpleGrading (1 1 1)  //zweite Klammer anpassen -> Blocks in x y z richtung
);

edges
(
);

boundary
(
    allBoundary
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
