03_CellGrowthSolver/testCase/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces
(
    "top.stl"
    "RF.stl"
    "stirrer.stl"
    "wall1.stl"
    "bottom.stl"
    "stirrerholder.stl"
);

// Identify a feature when angle between faces < includedAngle
includedAngle       120;

// ************************************************************************* //
